app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    if @task.save
---
INSERT INTO "tasks" ("id", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["id", 1], ["title", "this is my first task"], ["created_at", "2021-12-23 13:06:09.479062"], ["updated_at", "2021-12-23 13:06:09.479062"]]

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "title" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "this is my second task"], ["updated_at", "2021-12-23 13:03:26.778778"], ["id", 2]]