app/models/tag.rb

  def self.tag_id(name)
    Tag.where(name: name).pluck(:id)
---
SELECT "tags"."id" FROM "tags" WHERE "tags"."name" = ?  [["name", "#this"]]