app/models/task.rb

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "#2nd"], ["created_at", "2021-12-23 18:15:56.020915"], ["updated_at", "2021-12-23 18:15:56.020915"]]
SELECT "tags"."id" FROM "tags" WHERE "tags"."name" = ?  [["name", "#this"]]
---
  def create_tags
    get_hash_tags(title).each do |tag|
      Tag.find_or_create_by!(name: tag)